export const TermsOfServicePage = () => {
    return (
        <div class="bg-black2 text-white1">
            <div class="pt-20 pb-64 pl-20 pr-20">
                <div class="text-3xl">
                    利用規約
                </div>
                <p class="h-16" />
                <div class="text-2xl">
                    我々は、GoalToDoなどのサイトを含むサービスを提供します。
                </div>
                <p class="h-5" />
                <div class="text-5l">
                    当サイト（GoalToDo）には、３種類の利用者が存在します。
                    <p class="h-5" />
                    (1)本ウェブサイトの利用者を「サイト訪問者」といいます。
                    <p/>
                    (2)当サービスの無料バージョンを利用するユーザーを「無料ユーザー」といいます。無料ユーザーは、
                    サービスにアクセスし使用することができますが、加入者よりも限られたサービスの特徴・機能へのアク
                    セスのみ可能となっています。
                    <p/>
                    (3)GoalToDo有料加入プラン（加入しているレベルにかかわらず）の一部として本サービスを利用するユーザーを
                    「加入者」といいます。加入者が利用できる本サービスの特徴および機能は、加入者レベル、ならびに本サービスの
                    提供、アクセスおよび利用を規定する別契約（「カスタマー契約」といいます。）を締結した我々と組織（「カスタマー」
                    と呼ばれる、例えば、お客様の雇用者その他の事業体または個人）の間で合意された具体的な条件により決定されます。
                    <p class="h-5"/>
                    本利用規約において、これら3種類のユーザーを総称して「ユーザー」または「利用者様」といいます。本利用規約は、
                    ユーザーの種類にかかわらず、利用者様と我々の間の直接的な法的合意を形成し、本サービスおよび本ウェブサイトの
                    利用に対して適用されるルールを説明するものです。本サービスおよび本ウェブサイトについてアクセスまたは利用する
                    ことにより、利用者は、本利用規約および我々のプライバシーポリシーを読み、理解し、これに拘束されることに同意した
                    ことを確認し、同意するものとします。本利用規約に同意されない場合、本サービスおよび本ウェブサイトへのアクセス
                    または利用を行わないでください。
                    <p class="h-5"/>
                    我々は、随時、本利用規約を変更することができるものとします。更新を確認するため定期的にこのページをご確認ください。
                    我々は、本利用規約の変更に関する通知を利用者様に提供するために、適用される現地の法的義務を順守します。当該
                    アップデート後の本サービスおよび本ウェブサイトの継続的な利用により、当該変更を受諾したことになります。
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                利用資格および適用範囲
                </div>
                <p class="h-5" />
                <div class="text-5l">
                (1)総則　本サービスおよび本ウェブサイトを利用するには、利用者様は、少なくとも18歳であり、本利用規約に同意する能力があること
                を表明し、保証しなければなりません。本サービスおよび本ウェブサイトへのアクセスまたは利用を我々が禁じたことがある場合、
                本サービスおよび本ウェブサイトへのアクセスまたは利用は許可されません。
                (2)所在地.　本利用規約は、日本国内外のユーザーに適用されます。
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                アカウントの登録および利用
                </div>
                <p class="h-5" />
                <div class="text-5l">
                    <p />
                    (1)アカウント登録および秘密保持　本サービスおよび本ウェブサイトにアクセスするには、ユーザー名とパスワードを作成して、
                    GoalToDoアカウントを登録する必要があります。お客様は、お客様自身に関する正確、完全かつ最新の登録情報を当社に提供する
                    ことに同意するものとします。パスワードの機密性と安全性を確保することは、利用者様の責任です。利用者様は、登録することにより、
                    利用者様のユーザー名とパスワードの下で発生するすべてのアクティビティに対して全責任を負うことに同意するものとします。
                    我々は、利用者様のアカウントにおいて我々が受領したコミュニケーションは、利用者様により行われたと想定することができるものとします。
                    利用者様が請求書の所有者もしくは管理者である場合、または利用者様がカスタマーに代わって決定を行う権限を有することを書面で確認した場合
                    （「アカウント管理者」といいます。）、利用者様は、利用者様がカスタマーに代わって決定を行う権限を有することを表明し、保証し、
                    我々が利用者様の指示に依拠することができることに同意します。
                    <p />
                    (2)アカウントの不正利用　利用者様は、利用者様のアカウントの不正な利用またはアクセスを知った場合、goalTodo@gmail.comに宛てて我々
                    に通知する責任を負います。利用者様は、利用者様の身元を確認し、利用者様のアカウントのセキュリティを確保するために使用される情報の提供を我々
                    が利用者様に要求することができることを理解し、これに同意するものとします。我々は、利用者様が知っていたかまたは許諾していたか否かに
                    かかわらず、また利用者様が当該不正利用を我々に通知したか否かにかかわらず、利用者様のパスワードまたはアカウントを他者が使用の結果として
                    利用者様が被る損失、損害、責任、費用または弁護士費用につき一切責任を負いません。利用者様は、利用者様のアカウントを他者が使用したことにより
                    我々または第三者が被った損失、損害、責任、費用および弁護士費用に対して責任を負います。アカウント管理者またはカスタマーがアカウント
                    へのアクセスを失った場合、またはその他アカウントに関する情報を要求した場合、我々は、その独自の裁量により、当該アカウントへのアクセス
                    を回復するかまたは当該アカウントに関する情報を提供する前に、必要とみなす検証をアカウント管理者またはカスタマーに要求する権利を留保します。
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                ユーザーコンテンツおよびフィードバック
                </div>
                <p class="h-5" />
                <div class="text-5l">
                本サービスにおけるユーザーコンテンツと提供　本サービスでは、タスクを作成し、関連する情報、テキスト、ファイル、その他の資料（「ユーザーコンテンツ」
                と総称します。）を提供し、そのユーザーコンテンツを他のユーザーと共有することができます。本サービスにおいて提供その他の方法で利用可能にされる
                ユーザーコンテンツは、以下の条件に従うものとします。
                <p class="h-3"/>
                (1)無料ユーザーコンテンツ　無料ユーザーは、本サービスに提供するユーザーコンテンツ（「無料ユーザーコンテンツ」といいます。）のオーナーシップを
                維持します。無料ユーザーコンテンツを提出することにより、無料ユーザーは、法がそれを要求する場合および法的手続を誠実に遵守するため必要な場合を
                含め、我々のプライバシーポリシーで許可されているとおり、我々に対し、当該無料ユーザーコンテンツにアクセスし、使用し、複写し、複製し、加工し、
                改変し、出版し、送信し、展示するライセンスを付与します。我々は、本利用規約に違反する、または我々の独自の裁量で不適切と考えられる本サービス上の
                無料ユーザーコンテンツを除去する権利を留保します。
                <p/>
                (2)本サービスの加入者ユーザーコンテンツ　加入者により本サービスに提出されたコンテンツ（「加入者ユーザーコンテンツ」といいます。）は、教育機関との
                カスタマー契約に基づき学生により提供された加入者ユーザーコンテンツ（「学生コンテンツ」といいます。）に関する場合を除き、本利用規約
                に定めるとおり、カスタマーにより保有され、管理されます。学生コンテンツは、教育機関ではなく、学生によって保有されます。我々は、加入者
                ユーザーコンテンツのアクセス、使用、複写、複製、加工、改変、出版、送信、ホスト、および展示について、限定的、非独占的かつ譲渡不能の（事業の売却
                または移転に関連する場合を除く）ライセンスを、以下の限定的な目的のために維持します。（i）本サービスの維持、提供および改善のため、（ii）技術上また
                はセキュリティ上の問題の予防または対処およびサポート要請の解決のため、（iii）当該加入者ユーザーコンテンツがカスタマー契約または本利用規約に違反
                しているとの誠実な信念を有しているかまたは申し立てを受けた場合の調査のため、（iv）カスタマー契約および当社の法執行ガイドラインの要件を満たす有効な
                法的召喚状、要求またはその他の合法的手続の遵守のため、（v）カスタマー契約に別段の規定があるかまたはカスタマーが書面で明示的に許可する場合
                <p class="h-3"/>
                本ウェブサイトのフィードバック　本ウェブサイトには、コメントや情報その他の資料（総称して「フィードバック」）を我々に提出し、他のユーザーや一般の
                方々と共有できる機能があります。本ウェブサイトを通じてフィードバックを提出することにより、利用者様は、我々に対し、何らかの目的（利用者の声その他の
                我々のマーケティング資料としての場合、および法律または法的手続きを順守するために誠意を持って要求される場合を含む）のために、フィードバックにアクセスし、
                使用し、複写し、複製し、処理し、改変し、出版し、送信し、ホストし、展示することを許可します。我々は、公開フォーラムに投稿されたフィードバックを、当社の
                独自の裁量でいかなる理由でも撤回する権利を留保します。
                <p class="h-3"/>
                ユーザーコンテンツおよびフィードバックの表明　利用者様は、利用者様が、第三者の権利を侵害することなく、ユーザーコンテンツおよびフィードバックを提出する
                ために必要なすべての権利を有することを確認し、これに同意するものとします。利用者様は、我々がユーザーコンテンツまたはフィードバックをコントロールせず、
                責任を負わないこと、また本サービスまたは本ウェブサイトを利用することにより、利用者様が、攻撃的、わいせつ、不正確、誤解を招く、その他不快な他のユーザー
                からのユーザーコンテンツまたはフィードバックにさらされる可能性があることを理解するものとします。また、ユーザーコンテンツおよびフィードバックには、
                タイポのエラー、その他の不注意によるエラー、または不正確さが含まれる場合があることにご注意ください。利用者様は、利用者様が本サービスまたは本ウェブサイト
                を通じて提出するユーザーコンテンツまたはフィードバックに起因するすべてのクレームにつき、我々を補償し、防御し、免責することに同意します。我々は、我々の
                費用負担で、当該紛争の独占的防御およびコントロールを引き受ける権利を留保し、いかなる場合にも、利用者様は、利用可能な防御を主張するにあたり、我々に
                協力するものとします。
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                ライセンスおよび許容される利用
                </div>
                <p class="h-5" />
                <div class="text-5l">
                (1)利用者様のライセンス　本利用規約の遵守を条件として、我々は、利用者様に対し、利用者様の利用（または加入者の場合は、カスタマーにより承認された利用）のため
                にのみ、かつ利用者様または利用者様の本サービスおよび本ウェブサイトの利用に適用されるすべての法的要件（我々のプライバシーポリシーおよび本利用規約を含む）
                を遵守する方法でのみ、本サービスおよび本ウェブサイトにアクセスし、利用するための、限定的、非独占的、サブライセンス不可、譲渡不可、および取消可能な
                ライセンスを付与します。我々は、その独自の裁量により、いつでも本ライセンスを取り消すことができます。
                <p/>
                (2)許容される利用 すべてのユーザーは、本サービスおよび本ウェブサイトの許容される利用に関して、以下の規則を順守しなければなりません。
                <p/>
                サービスの混乱　以下のことはできません。
                <p/>
                ・本サービスおよび本ウェブサイト、Asanaのコンピュータシステム、または我々のプロバイダの技術的な提供システムの公開されていないエリアへのアクセス、改ざん、または利用
                <p/>
                ・システムやネットワークの脆弱性を調査、スキャン、テストしたり、セキュリティや認証手段に違反したり、回避したりすること
                <p/>
                ・我々が公にサポートしているインタフェース以外の手段（例えば、「スクレイピング」）で、本サービスおよび本ウェブサイトにアクセスまたは検索すること
                <p/>
                ・我々の資源に不当な要求や負担を意図的に課す（例えば、「ボット」や他の自動システムを使って、同じ期間に人間のユーザーが送ることのできる速度を超えた速度で我々のサーバに
                要求を送る）ことによって、我々のインフラストラクチャを混乱させたり、圧倒させたりする試み
                <p/>
                ・本サービスおよび本ウェブサイトに対するウイルスの送信、オーバーロード、フローディング、スパム送信、メール爆弾、サービスやウェブサイトなど、または本サービスおよび
                本ウェブサイトを妨害する形もしくは不当な負担を与えるような方法でユーザーコンテンツの作成をスクリプトで行うことなどを含む、ユーザー、ホストまたはネットワークのアクセスを
                妨害または混乱させる試み
                <p/>
                本サービスおよび本ウェブサイトの悪用　本サービスおよび本ウェブサイトを利用して、以下を実施、促進またはサポートすることはできません。
                <p/>
                ・違法または不正の行為
                <p/>
                ・他人若しくは団体を装うこと、又は他人を誤認させ、混同させ若しくは欺くような態様若しくはその意図を持って他人若しくは団体との提携を誤認する表示をすること
                <p/>
                ・中傷的、名誉毀損、又は脅迫的な行為であって、ヘイトスピーチ、ハラスメント又はストーカー行為を構成するもの
                <p/>
                ・明示の許可および許可を得ないで、他人の私的又は個人的情報を公表し、又は投稿すること
                <p/>
                ・要請されていない通信、プロモーション広告、またはスパムの送信
                <p/>
                ・他のユーザーのブラウザやコンピュータを損傷したり混乱させたりすることを意図した悪意のあるコンテンツの公開やそれへのリンク、または、適切な許可なしに自分以外の製品または
                サービスのプロモーションや宣伝を行うこと
                <p/>
                本サービスおよび本ウェブサイト内のユーザーコンテンツの基準　以下のユーザーコンテンツを本サービスまたは本ウェブサイトに投稿することはできません
                <p/>
                ・適用される法律、第三者の知的財産権、またはプライバシー権もしくはパブリシティ権を侵害するもの
                <p/>
                ・誤解を招くもの、詐欺的、違法、わいせつ、ポルノ（児童ポルノを含む。当社は、これを知った時点で、削除します。）、ヘイトスピーチ、ハラスメントまたは
                ストーカー行為を硬性する中傷的、名誉毀損的、脅迫的なもの
                <p/>
                ・未成年者の個人情報を含むもの
                <p/>
                ・カスタマー契約の一部として認められたAsanaの事前の文書による同意なしに、財務情報、支払カード番号、社会保障番号、または健康情報などのセンシティブな個人情報を含むもの
                <p/>
                ・ウイルス、ボット、ワーム、または類似の有害なものを含み、または法律または契約上もしくは受託者の義務に基づいて利用可能となる権利を有しない情報を含むもの
                <p class="h-3"/>
                本「ライセンスおよび許容される利用」の違反　我々が利用可能なその他の救済に加えて、我々は、利用者様が本「ライセンスおよび許容される利用」の規則に従わなかった場合、
                または我々の独自の裁量により、その他のユーザーのために本サービスまたは本ウェブサイトが中断することを防止するために当該措置が必要である場合、我々は、通知をもって、
                我々が責任を負うことなく、利用者様のアカウントまたは本サービスもしくは本ウェブサイトへのアクセスの即時停止もしくは終了を含め、必要とみなす救済を行う権利を留保します。
                利用者様が加入者である場合、我々は、本利用規約の違反につきカスタマーのアカウント管理者またはその他のカスタマーの代表者に通知する権利を留保します。
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                プライバシー
                </div>
                <p class="h-5" />
                <div class="text-5l">
                当社が、利用者様から、利用者様に関して、どのようにデータを収集し、利用し、共有するかに関する情報については、本利用規約に参照されて組み込まれている我々の
                プライバシーポリシーをご覧ください
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                責任制限
                </div>
                <p class="h-5" />
                <div class="text-5l">
                我々が本利用規約を順守しない場合、我々は、我々の本利用規約の違反または当社の過失の結果として予見可能な範囲で利用者様が被る損失または損害に対して責任を負いますが、
                我々は、予見することができない損失または損害に対して責任を負いません。損失または損害は、それが我々の違反の明白な結果である場合、またはそれが承諾された注文である場合に、
                予見可能です。また、我々は、本サービスおよび本ウェブサイトを、利用者様の内部利用のためにのみ提供しています。我々は、利用者様が本サービスおよび本ウェブサイトを利用
                または信頼したことによる利益喪失、事業の喪失、事業の中断またはビジネスチャンスの喪失につき、一切責任を負いません。我々は、排除または制限することが違法となる場合には、
                利用者様に対する我々の責任をいかなる方法でも排除または制限しません。これには、我々、または我々の従業員、代理人もしくは下請業者の過失に起因する死亡または人身傷害への責任、
                詐欺または虚偽の表明への責任、ならびに本サービスおよび本ウェブサイトに関する利用者様の法的権利の侵害に対する責任が含まれます。
                <p class="h-3" />
                本サービスおよび本ウェブサイトに掲載されている情報は、一般的な情報提供のみを目的としています。我々は、この情報の正確性、完全性、有用性を確認しません。そのような情報を
                信頼することは、あなた自身の責任のみによることになります。
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                ウイルス
                </div>
                <p class="h-5" />
                <div class="text-5l">
                利用者様は、我々が、インターネットまたは我々のサービスもしくは本ウェブサイトからダウンロードできるファイルが、ウイルスその他の破壊的コードを含まないことを保証する
                ことはできず、また保証するものではないことを了解するものとします。利用者様は、ウイルス対策およびデータの入出力の正確性に関する利用者様特有の要件を満たすために、十分な手順
                およびチェックポイントを実施する責任を負い、また、紛失したデータを再構築するために、本サービスおよび本ウェブサイト以外の外部の手段を維持する責任を負います。
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                サードパーティのリンクとサービス
                </div>
                <p class="h-5" />
                <div class="text-5l">
                本件サービスおよび本件ウェブサイトは、（1）第三者から提供された情報およびコンテンツ、（2）商品およびサービスの販売者等の第三者のウェブサイト又はリソースへのリンク、および
                （3）利用者様に直接販売するための第三者の製品およびサービスを提供することができるものとします。我々は、当該外部サイトまたはリソースの可用性に責任を負わず、（i）当該サイト
                またはリソース上で利用可能なコンテンツ、広告、製品もしくはその他の材料、（ii）これらのウェブサイトまたはリソースにおけるエラーもしくは不作為、または（iii）当該サイトもしくは
                リソースの運営者の情報取扱のプラクティスまたはその他の事業のプラクティスを支持せず、責任を負いません。さらに利用者様は、我々が、リンクされたサイトまたはリソースの利用または
                それへの信頼に起因または関連して引き起こされた、または引き起こされたと主張された損害または損失に対して、直接間接を問わず、責任または責を負わないことを認識し、これに同意
                するものとします。当該第三者との利用者様との関係は、第三者のサービスおよびプライバシーに関する独自の規約、ならびにその他類似の規約に準拠するものとします。
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                変更
                </div>
                <p class="h-5" />
                <div class="text-5l">
                我々は、通知の有無にかかわらず、いつでも、本サービスおよび本ウェブサイト（またはその一部）を変更しまたは中止する権利を留保します。利用者様は、我々が本サービスおよび
                ウェブサイトの修正、停止または中止につき利用者様または第三者に責任を負わないことに同意するものとします。
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                準拠法
                </div>
                <p class="h-5" />
                <div class="text-5l">
                (1)本規約等は、日本法を準拠とし、解釈されるものとします。
                <p/>
                (2)本サービスに関して紛争が生じた場合には、我々を管轄する裁判所を専属的合意管轄とします。
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                一般条件
                </div>
                <p class="h-5" />
                <div class="text-5l">
                (1)権利放棄の否認　我々が、利用者様に本利用規約に基づく義務を履行することを主張できなかった場合、
                または我々が利用者様に対して我々の権利を行使しない場合、または我々がそのようにすることを遅延した場合
                であっても、我々が当該権利を放棄したことを意味せず、利用者様が利用者様の義務を遵守する必要がないこと
                を意味しません。我々がお客様による不履行または違反を免責する場合、当社は書面のみによるものとし、
                それは我々が利用者様による将来の違反または不履行を自動的に免責することを意味するものではありません。
                <p/>
                (2)分離可能性　本利用規約の各条項は、別個に作用するものとします。いずれかの裁判所または関係当局が、
                本利用規約のいずれかが違法または強制不能であると決定した場合、残りの条項は、引き続き全面的に有効に存続します。
                <p/>
                (3)雑則　本条項の表題は、便宜上のものであり、法的または契約上の効力を有しません。
                <p/>
                (4)通知　我々は、電子メール、本サービスおよび本ウェブサイト上の通知または当社が選択するその他の方法により
                通知を利用者様に送付することができ、かかる通知は発送時に有効となります。利用者様が我々に通知する場合、
                当該通知は受領時に有効となり、利用者様は以下の物理的または電子メールアドレスを使用しなければなりません。
                <p/>
                goalTodo@gmail.com
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                    お問い合わせ
                </div>
                <p class="h-5" />
                <div class="text-5l">
                    個人情報の取扱に関するお問い合せは下記よりご連絡ください。
                    <p class="h-3" />
                    電子メール:　goalTodo@gmail.com
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                    （附則）
                </div>
                <p class="h-5" />
                <div class="text-5l">
                    2022年2月20日制定 2022年2月20日適用
                </div>
            </div>
        </div>
    )
}