

export const PrivacyPolicyPage = () => {
    return (
        <>
            <div class="bg-white-1 pt-20 pb-64 pl-20 pr-20">
                <div class="text-3xl">
                    プライバシーポリシー
                </div>
                <p class="h-16" />
                <div class="text-2xl">
                    個人情報の取り扱いについて
                </div>
                <p class="h-5" />
                <div class="text-5l">
                    当サイト（GoalToDo）では、以下のとおり個人情報保護方針を定め、個人情報保護の仕組みを構築し、
                    個人情報保護の重要性の認識と取組みを徹底させることにより、個人情報の保護を推進致します。
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                    個人情報の管理
                </div>
                <p class="h-5" />
                <div class="text-5l">
                    利用者様の個人情報を正確かつ最新の状態に保ち、個人情報への不正アクセス・紛失・破損・改ざん・
                    漏洩などを防止するため、セキュリティシステムの維持・管理体制の整備等の必要な措置を講じ、安全対
                    策を実施し個人情報の厳重な管理を行ないます。
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                    個人情報の利用目的
                </div>
                <p class="h-5" />
                <div class="text-5l">
                    本サービスのサービス提供にかかわる利用者様情報の具体的な利用目的は以下のとおりです。
                    <p />
                    (1)本サービスに関する登録の受付、本人確認、利用料金の計算等本サービスの提供、維持、保護及び改善のため
                    <p />
                    (2)本サービスに関するご案内、お問い合せ等への対応のため
                    <p />
                    (3)我々のサービスに関連して、個人を識別できない形式に加工した統計データを作成するため
                    <p />
                    (4)我々又は第三者の広告の配信又は表示のため
                    <p />
                    (5)上記の利用目的に付随する利用目的のため
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                    個人情報の第三者への開示・提供の禁止
                </div>
                <p class="h-5" />
                <div class="text-5l">
                    利用者様よりお預かりした個人情報を適切に管理し、次のいずれかに該当する場合を除き、個人情報を第三者に開示・
                    提供いたしません。
                    <p />
                    (1)利用者様の同意がある場合
                    <p />
                    (2)利用者様が希望されるサービスを行なうために我々が業務を委託する業者に対して開示・提供する場合
                    <p />
                    (3)法令に基づき開示することが必要である場合
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                    個人情報の安全対策
                </div>
                <p class="h-5" />
                <div class="text-5l">
                    個人情報を偶発的または違法な破壊、偶発的な紛失、改ざん、不正な開示やアクセスから保護するために、技術的および組織的な措置を講じています。
                    ただし、インターネットを介した送信方法、電子または物理的な保存手段は決して完全に安全ではないため、
                    我々はその情報のセキュリティを保証することはできません。我々は、常に当社の安全保護策を更新し改善しています。
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                    ご本人の照会
                </div>
                <p class="h-5" />
                <div class="text-5l">
                    利用者様がご本人の個人情報の照会・修正・削除などをご希望される場合には、ご本人であることを確認の上、対応させていただきます。
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                    免責について
                </div>
                <p class="h-5" />
                <div class="text-5l">
                    以下の場合は、第三者による個人情報の取得に関し、我々は何らの責任を負いません。
                    (1)利用者様ご本人が第三者に個人情報を明らかにした場合
                    <p />
                    (2)利用者様が我々のサービス上に入力した情報等により、個人が識別できてしまった場合
                    <p />
                    (3)第三者が我々のサービス外(我々サービスからリンクの張られている他のサイトを含む)で個人情報を取得した場合
                    <p />
                    (4)利用者の皆様ご本人以外が利用者を識別できる情報(ID, パスワード等)を入手した場合
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                    プライバシーポリシーの変更
                </div>
                <p class="h-5" />
                <div class="text-5l">
                    我々は、我々のデータ収集および使用慣行、我々の優れた機能、技術の進歩が、適用法が求め
                    るとおりに正確に反映されることを確実にするため、本プライバシーポリシーの内容を更新します。
                    我々は、変更を行う場合に、その変更の種類に応じて必要とされる利用者様への通知および/または同意の提供において
                    適用される法的要件に従います。
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                    お問い合わせ
                </div>
                <p class="h-5" />
                <div class="text-5l">
                    個人情報の取扱に関するお問い合せは下記よりご連絡ください。
                    <p class="h-3" />
                    電子メール:　inquiry.ratdotl@gmail.com
                </div>
                <p class="h-10" />
                <div class="text-2xl">
                    （附則）
                </div>
                <p class="h-5" />
                <div class="text-5l">
                    2022年2月20日制定 2022年2月20日適用
                </div>
            </div>
        </>
    )
}